---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeBendAngle
source: html/176a9649-853e-f173-c108-d6722fcd5b61.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeBendAngle

A bend in a rebar shape has an angular range
 specified by one of these values. The angles refer to
 the angle swept out by one segment as it is bent
 relative to another. That is, an "Obtuse" bend results
 in two segments that meet at an angle that is less
 than 90 degrees when measured internally. Put another
 way, to create an equilateral triangle, you would need
 two "Obtuse" bends.

## Syntax (C#)
```csharp
public enum RebarShapeBendAngle
```